src/InformationRegisters/ЖурналОбменаИЭМК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЖурналОбменаИЭМК</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтветИЭМК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УидВИЭМК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЖурналОбменаИЭМК/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Процедура, добавляет запись в регистр сведений;
//
Процедура ДобавитьЗапись(Объект, КодОтвета, ОтветИЭМК, УидВИЭМК, УИД, КоличествоПопыток, ДатаОтправки = Неопределено) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.ЖурналОбменаИЭМК.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Объект       		= Объект;
	МенеджерЗаписи.КодОтвета 			= КодОтвета;
	МенеджерЗаписи.ОтветИЭМК    		= ОтветИЭМК;
	МенеджерЗаписи.УидВИЭМК     		= УидВИЭМК;
	МенеджерЗаписи.УИД     				= УИД;
	МенеджерЗаписи.КоличествоПопыток    = КоличествоПопыток;
	МенеджерЗаписи.ДатаОтправки     	= ДатаОтправки;

	
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
